*> This is free-form
IDENTIFICATION DIVISION.
PROGRAM-ID. CREATE-ACCOUNT.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ACCOUNT-FILE ASSIGN TO "../data/AccountRecords.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD ACCOUNT-FILE.
01 ACCOUNT-RECORD         PIC X(100).

WORKING-STORAGE SECTION.
COPY "AccountRecord.cpy".
01 PARSED-ARGS.
       05 IN-USERNAME     PIC X(20).
       05 IN-PASSWORD     PIC X(12).

LINKAGE SECTION.
01 ARGS         PIC X(100).

PROCEDURE DIVISION USING ARGS.
    UNSTRING ARGS DELIMITED BY ","
        INTO IN-USERNAME, IN-PASSWORD
    END-UNSTRING

    MOVE IN-USERNAME TO AR-USERNAME.
    MOVE IN-PASSWORD TO AR-PASSWORD.
    MOVE SPACES TO ACCOUNT-RECORD.

    STRING AR-USERNAME DELIMITED BY SPACE
         "," DELIMITED BY SIZE
         AR-PASSWORD DELIMITED BY SPACE
         INTO ACCOUNT-RECORD
    END-STRING

    OPEN EXTEND ACCOUNT-FILE.
    WRITE ACCOUNT-RECORD.
    CLOSE ACCOUNT-FILE.

    DISPLAY "Welcome, " AR-USERNAME

    EXIT PROGRAM.
