*> This is free-form
IDENTIFICATION DIVISION.
PROGRAM-ID. CREATE-ACCOUNT.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 USERNAME    PIC X(20).
01 PASSWORD    PIC X(12).

LINKAGE SECTION.
01 ARGS        PIC X(100).

PROCEDURE DIVISION USING ARGS.
    UNSTRING ARGS DELIMITED BY ","
        INTO USERNAME, PASSWORD
    END-UNSTRING

    DISPLAY "Welcome!"
    DISPLAY USERNAME

    EXIT PROGRAM.
