*> This is free-form
IDENTIFICATION DIVISION.
PROGRAM-ID. INCOLLEGE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INFILE ASSIGN TO "../data/InCollege-Input.txt"
        ORGANIZATION IS SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  INFILE.
01  IN-REC     PIC X(100).

WORKING-STORAGE SECTION.
01  EOF        PIC X VALUE "N".

PROCEDURE DIVISION.
    OPEN INPUT INFILE
    PERFORM UNTIL EOF = "Y"
        READ INFILE
            AT END MOVE "Y" TO EOF
            NOT AT END DISPLAY IN-REC
        END-READ
    END-PERFORM
    CLOSE INFILE
    STOP RUN.
