*> This is free-form
IDENTIFICATION DIVISION.
PROGRAM-ID. LOGIN.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ACCOUNT-FILE ASSIGN TO "../data/AccountRecords.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD ACCOUNT-FILE.
01 ACCOUNT-RECORD          PIC X(100).

WORKING-STORAGE SECTION.
COPY "AccountRecord.cpy".
01 EOF-ACCT                PIC X(1) VALUE "N".
01 FILE-USERNAME           PIC X(20).
01 FILE-PASSWORD           PIC X(12).

LINKAGE SECTION.
01 IN-USERNAME   PIC X(20).
01 IN-PASSWORD   PIC X(12).
01 RESPONSE       PIC X(100).
01 LOGIN-STATUS   PIC X(1).

PROCEDURE DIVISION USING IN-USERNAME, IN-PASSWORD, RESPONSE, LOGIN-STATUS.
    MOVE IN-USERNAME TO AR-USERNAME.
    MOVE IN-PASSWORD TO AR-PASSWORD.
    MOVE SPACES TO ACCOUNT-RECORD.

    STRING AR-USERNAME DELIMITED BY SPACE
         "," DELIMITED BY SIZE
         AR-PASSWORD DELIMITED BY SPACE
         INTO ACCOUNT-RECORD
    END-STRING

    PERFORM VALIDATE-LOGIN
    IF LOGIN-STATUS NOT = "Y"
        MOVE SPACES TO RESPONSE
        STRING "Invalid password for " DELIMITED BY SIZE
           AR-USERNAME DELIMITED BY SPACE
           INTO RESPONSE
        END-STRING
        MOVE "N" TO LOGIN-STATUS
        GOBACK
    END-IF

    MOVE "You have successfully logged in." TO RESPONSE
    MOVE "Y" TO LOGIN-STATUS

    GOBACK.

VALIDATE-LOGIN.
    MOVE "N" TO EOF-ACCT
    OPEN INPUT ACCOUNT-FILE
    PERFORM UNTIL EOF-ACCT = "Y"
        READ ACCOUNT-FILE
            AT END
                MOVE "Y" TO EOF-ACCT
            NOT AT END
                IF ACCOUNT-RECORD NOT = SPACES
                   UNSTRING ACCOUNT-RECORD DELIMITED BY ","
                   INTO FILE-USERNAME FILE-PASSWORD
                   END-UNSTRING
                   IF FILE-USERNAME = IN-USERNAME
                       IF FILE-PASSWORD = IN-PASSWORD
                           MOVE "Y" TO LOGIN-STATUS
                       END-IF

                       CLOSE ACCOUNT-FILE
                       EXIT PARAGRAPH
                   END-IF
                END-IF
        END-READ
    END-PERFORM
    CLOSE ACCOUNT-FILE.
    MOVE "Y" TO EOF-ACCT
    EXIT PARAGRAPH.
